<template>
  <app-header></app-header>
  <div class="py-3 px-5 pt-8 mx-auto text-gray-700 leading-7 container">
    <h1 class="text-2xl py-2">利用規約</h1>
    <p class="pl-2">
      この利用規約（以下、「本規約」といいます。）は、フリーランス集団てげほげ（以下、「当組織」といいます。）がこのウェブサイト上で提供するサービス（以下、「本サービス」といいます。）の利用条件を定めるものです。
      利用者の皆さま（以下、「利用者」といいます。）には、本規約に従って本サービスをご利用いただきます。
    </p>
    <h2 class="text-xl py-2">第1条（適用）</h2>
    <ol class="list-decimal pl-8">
      <li>
        本規約は、利用者と当組織との間の本サービスの利用に関わる一切の関係に適用されるものとします。
      </li>
      <li>
        当組織は本サービスに関し、本規約のほか、ご利用にあたってのルール等、各種の定め（以下、「個別規定」といいます。）をすることがあります。これら個別規定はその名称のいかんに関わらず、本規約の一部を構成するものとします。
      </li>
      <li>
        本規約の規定が前条の個別規定の規定と矛盾する場合には、個別規定において特段の定めなき限り、個別規定の規定が優先されるものとします。
      </li>
    </ol>
    <h2 class="text-xl py-2">第2条（パスワードの管理）</h2>
    <ol class="list-decimal pl-8">
      <li>
        利用者は自己の責任において、本サービスに登録したパスワードを適切に管理するものとします。
      </li>
      <li>
        利用者は、パスワードをイベントの共同管理者を除く第三者に譲渡または貸与することはできません。当組織は、パスワードが登録情報と一致してイベント情報が編集された場合には、その利用者および共同管理者による利用とみなします。
      </li>
      <li>
        パスワードが第三者によって使用されたことによって生じた損害は、当組織に故意又は重大な過失がある場合を除き、当組織は一切の責任を負わないものとします。
      </li>
    </ol>
    <h2 class="text-xl py-2">第3条（禁止事項）</h2>
    <p class="pl-2">利用者は、本サービスの利用にあたり、以下の行為をしてはなりません。</p>
    <ol class="list-decimal pl-8">
      <li>法令または公序良俗に違反する行為</li>
      <li>犯罪行為に関連する行為</li>
      <li>本サービスの内容等、本サービスに含まれる著作権、商標権ほか知的財産権を侵害する行為</li>
      <li>
        当組織、ほかの利用者、またはその他第三者のサーバーまたはネットワークの機能を破壊したり、妨害したりする行為
      </li>
      <li>本サービスによって得られた情報を商業的に利用する行為</li>
      <li>当組織のサービスの運営を妨害するおそれのある行為</li>
      <li>不正アクセスをし、またはこれを試みる行為</li>
      <li>他の利用者に関する個人情報等を収集または蓄積する行為</li>
      <li>不正な目的を持って本サービスを利用する行為</li>
      <li>本サービスの他の利用者またはその他の第三者に不利益、損害、不快感を与える行為</li>
      <li>他の利用者に成りすます行為</li>
      <li>当組織が許諾しない本サービス上での宣伝、広告、勧誘、または営業行為</li>
      <li>面識のない異性との出会いを目的とした行為</li>
      <li>当組織のサービスに関連して、反社会的勢力に対して直接または間接に利益を供与する行為</li>
      <li>その他、当組織が不適切と判断する行為</li>
    </ol>
    <h2 class="text-xl py-2">第4条（本サービスの提供の停止等）</h2>
    <ol class="list-decimal pl-8">
      <li>
        当組織は、以下のいずれかの事由があると判断した場合、利用者に事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。
        <ol class="list-decimal pl-8">
          <li>本サービスにかかるコンピュータシステムの保守点検または更新を行う場合</li>
          <li>
            地震、落雷、火災、停電または天災などの不可抗力により、本サービスの提供が困難となった場合
          </li>
          <li>コンピュータまたは通信回線等が事故により停止した場合</li>
          <li>その他、当組織が本サービスの提供が困難と判断した場合</li>
        </ol>
      </li>
      <li>
        当組織は、本サービスの提供の停止または中断により、利用者または第三者が被ったいかなる不利益または損害についても、一切の責任を負わないものとします。
      </li>
    </ol>
    <h2 class="text-xl py-2">第5条（利用制限および登録抹消）</h2>
    <ol class="list-decimal pl-8">
      <li>
        当組織は、利用者が作成したイベントが以下のいずれかに該当する場合には、事前の通知なく、イベントの登録を抹消することができるものとします。
        <ol class="list-decimal pl-8">
          <li>本規約のいずれかの条項に違反した場合</li>
          <li>その他、当組織が本サービスの利用を適当でないと判断した場合</li>
        </ol>
      </li>
      <li>
        当組織は、本条に基づき当組織が行った行為によりに生じた損害について、一切の責任を負いません。
      </li>
    </ol>
    <h2 class="text-xl py-2">第6条（保証の否認および免責事項）</h2>
    <ol class="list-decimal pl-8">
      <li>
        当組織は、本サービスに事実上または法律上の瑕疵（安全性、信頼性、正確性、完全性、有効性、特定の目的への適合性、セキュリティなどに関する欠陥、エラーやバグ、権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。
      </li>
      <li>
        当組織は、本サービスに起因して利用者に生じたあらゆる損害について一切の責任を負いません。
      </li>
      <li>
        当組織は、本サービスに関して、利用者と他の利用者または第三者との間において生じた取引、連絡または紛争等について一切責任を負いません。
      </li>
    </ol>
    <h2 class="text-xl py-2">第7条（サービス内容の変更等）</h2>
    <p>
      当組織は、利用者に通知することなく、本サービスの内容を変更しまたは本サービスの提供を中止することができるものとし、これによって利用者に生じた損害について一切の責任を負いません。
    </p>
    <h2 class="text-xl py-2">第8条（利用規約の変更）</h2>
    <p>
      当組織は、必要と判断した場合には、利用者に通知することなくいつでも本規約を変更することができるものとします。なお、本規約の変更後、本サービスの利用を開始した場合には、当該利用者は変更後の規約に同意したものとみなします。
    </p>

    <div class="text-right">以上</div>
  </div>
</template>

<script lang="ts">
import { defineComponent } from "vue";
import AppHeader from "../components/AppHeader.vue";

export default defineComponent({
  components: { AppHeader },
  name: "Terms",
  setup(props, context) {
    return {};
  },
});
</script>

<style></style>
